validation/AMR/cylinderBenchmark/RANS/2D/system/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vorticity
{
    type            vorticity;
    libs            ("libfieldFunctionObjects.so");

    writeControl    adjustableRunTime;
    writeInterval   0.01;
    log             true;
}

// ************************************************************************* //
